# SketchGridSpacingParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SketchGridSpacingParam Property
ParameterTypeId Class See Also
---
"Work Plane Grid Spacing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SketchGridSpacingParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SketchGridSpacingParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SketchGridSpacingParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace